some fking changes
